In [2]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns
from sklearn.metrics import confusion_matrix, mean_squared_error, r2_score, mean_absolute_error
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.preprocessing import StandardScaler

# 1. Data exploration and cleaning

In [61]:
df = pd.read_csv('./data/Loan_Data.csv') # data frame imported

In [62]:
df

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
609,LP002978,Female,No,0,Graduate,No,2900,0.0,71.0,360.0,1.0,Rural,Y
610,LP002979,Male,Yes,3+,Graduate,No,4106,0.0,40.0,180.0,1.0,Rural,Y
611,LP002983,Male,Yes,1,Graduate,No,8072,240.0,253.0,360.0,1.0,Urban,Y
612,LP002984,Male,Yes,2,Graduate,No,7583,0.0,187.0,360.0,1.0,Urban,Y
613,LP002990,Female,No,0,Graduate,Yes,4583,0.0,133.0,360.0,0.0,Semiurban,N

In [63]:
df.columns # better view of the columns names

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [64]:
df1 = df.copy() # making a copy of data frame

In [65]:
df1 = df1.rename(columns={'CoapplicantIncome': 'Coapplicant_Income','ApplicantIncome': 'Applicant_Income','LoanAmount': 'Loan_Amount'})
df1 = df1.drop('Loan_ID', axis = 1)
df1 # standartizing the columns names, removed LOAN ID row, as I will not use it

,Gender,Married,Dependents,Education,Self_Employed,Applicant_Income,Coapplicant_Income,Loan_Amount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
...,...,...,...,...,...,...,...,...,...,...,...,...
609,Female,No,0,Graduate,No,2900,0.0,71.0,360.0,1.0,Rural,Y
610,Male,Yes,3+,Graduate,No,4106,0.0,40.0,180.0,1.0,Rural,Y
611,Male,Yes,1,Graduate,No,8072,240.0,253.0,360.0,1.0,Urban,Y
612,Male,Yes,2,Graduate,No,7583,0.0,187.0,360.0,1.0,Urban,Y
613,Female,No,0,Graduate,Yes,4583,0.0,133.0,360.0,0.0,Semiurban,N

In [66]:
df1.dtypes # checking the types of data in columns

Gender                 object
Married                object
Dependents             object
Education              object
Self_Employed          object
Applicant_Income        int64
Coapplicant_Income    float64
Loan_Amount           float64
Loan_Amount_Term      float64
Credit_History        float64
Property_Area          object
Loan_Status            object
dtype: object

In [67]:
df1.isna().sum() # checking the number of NaN per column

Gender                13
Married                3
Dependents            15
Education              0
Self_Employed         32
Applicant_Income       0
Coapplicant_Income     0
Loan_Amount           22
Loan_Amount_Term      14
Credit_History        50
Property_Area          0
Loan_Status            0
dtype: int64

In [68]:
df1['Credit_History'].value_counts() #checking what the content of the column

1.0    475
0.0     89
Name: Credit_History, dtype: int64

Here I decided to drop rows with NaN-values on Credit History, as it is usually one of the most influential parameter for loan-regarding decisions, thus I did not want to risk by guessing it.

In [69]:
df2 = df1.dropna(subset=["Credit_History"]) 
df2.isna().sum()

Gender                12
Married                3
Dependents            15
Education              0
Self_Employed         26
Applicant_Income       0
Coapplicant_Income     0
Loan_Amount           21
Loan_Amount_Term      14
Credit_History         0
Property_Area          0
Loan_Status            0
dtype: int64

In [70]:
df2_numerical = df2.select_dtypes("number") # separating numerical from categorical values
df2_categorical = df2.select_dtypes("object")

In [71]:
for column in df2_categorical.columns: # replasing NaN values in categorical columns with mode
    mode = df2_categorical[column].mode()[0]
    df2_categorical[column].fillna(mode, inplace=True)

In [75]:
df2_categorical

,Gender,Married,Dependents,Education,Self_Employed,Property_Area,Loan_Status
0,Male,No,0,Graduate,No,Urban,Y
1,Male,Yes,1,Graduate,No,Rural,N
2,Male,Yes,0,Graduate,Yes,Urban,Y
3,Male,Yes,0,Not Graduate,No,Urban,Y
4,Male,No,0,Graduate,No,Urban,Y
...,...,...,...,...,...,...,...
609,Female,No,0,Graduate,No,Rural,Y
610,Male,Yes,3+,Graduate,No,Rural,Y
611,Male,Yes,1,Graduate,No,Urban,Y
612,Male,Yes,2,Graduate,No,Urban,Y
613,Female,No,0,Graduate,Yes,Semiurban,N

In [72]:
df2_categorical.isna().sum()

Gender           0
Married          0
Dependents       0
Education        0
Self_Employed    0
Property_Area    0
Loan_Status      0
dtype: int64

In [79]:
for column in df2_numerical.columns: # replasing NaN values in NUMERICAL columns with MEAN
    mean = df2_numerical[column].mean()
    df2_numerical[column].fillna(mean, inplace=True)

In [80]:
df2_numerical

,Applicant_Income,Coapplicant_Income,Loan_Amount,Loan_Amount_Term,Credit_History
0,5849,0,145.088398,360.0,1.0
1,4583,1508,128.000000,360.0,1.0
2,3000,0,66.000000,360.0,1.0
3,2583,2358,120.000000,360.0,1.0
4,6000,0,141.000000,360.0,1.0
...,...,...,...,...,...
609,2900,0,71.000000,360.0,1.0
610,4106,0,40.000000,180.0,1.0
611,8072,240,253.000000,360.0,1.0
612,7583,0,187.000000,360.0,1.0
613,4583,0,133.000000,360.0,0.0

In [81]:
dot = '.'
def remove_zeroes(x):
    result = round(x)
    return result 

for col in df2_numerical:
    df2_numerical[col] = df2_numerical[col].apply(remove_zeroes)

In [82]:
df2_numerical

,Applicant_Income,Coapplicant_Income,Loan_Amount,Loan_Amount_Term,Credit_History
0,5849,0,145,360,1
1,4583,1508,128,360,1
2,3000,0,66,360,1
3,2583,2358,120,360,1
4,6000,0,141,360,1
...,...,...,...,...,...
609,2900,0,71,360,1
610,4106,0,40,180,1
611,8072,240,253,360,1
612,7583,0,187,360,1
613,4583,0,133,360,0

In [83]:
df2_numerical.isna().sum()

Applicant_Income      0
Coapplicant_Income    0
Loan_Amount           0
Loan_Amount_Term      0
Credit_History        0
dtype: int64